
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/13343517625)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * module.prod__k8s_nodes.proxmox_vm_qemu.control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.proxmox_vm_qemu.gateway
* Replace
  * module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane[&#34;1&#34;]
  * module.prod__k8s_nodes.null_resource.vm_ci_config__gateway
  * module.prod__k8s_nodes.proxmox_vm_qemu.worker[&#34;1&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prod__k8s_nodes.null_resource.vm_ci_config__control_plane["1"] is tainted, so must be replaced
-/+ resource "null_resource" "vm_ci_config__control_plane" {
      ~ id = "7799501850583187530" -> (known after apply)
    }

  # module.prod__k8s_nodes.null_resource.vm_ci_config__gateway is tainted, so must be replaced
-/+ resource "null_resource" "vm_ci_config__gateway" {
      ~ id = "4365029799543555029" -> (known after apply)
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.control_plane["1"] will be created
  + resource "proxmox_vm_qemu" "control_plane" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__cp-01.yaml"
      + ciupgrade              = false
      + clone_wait             = 10
      + cores                  = 3
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.8.11/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 3072
      + name                   = "prod-k8s-cp-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;control_plane"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 811

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.gateway will be created
  + resource "proxmox_vm_qemu" "gateway" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = (known after apply)
      + bootdisk               = (known after apply)
      + cicustom               = "user=local:snippets/prod__k8s-vm_ci-config__gateway.yaml"
      + ciupgrade              = false
      + clone                  = "rhel-9.4"
      + clone_wait             = 10
      + cores                  = 2
      + cpu_type               = "x86-64-v3"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "This VM is managed by Terraform to run k8s."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb,memory,cpu"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.20.5/24,gw=192.168.20.1"
      + ipconfig1              = "ip=192.168.8.2/24,gw=192.168.8.1"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "prod-k8s-gw-01"
      + numa                   = true
      + onboot                 = true
      + os_type                = "cloud-init"
      + protection             = false
      + qemu_os                = "l26"
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + tablet                 = true
      + tags                   = "prod;terraform;k8s;gateway"
      + target_node            = "pve-01"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 801

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "20G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }
      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prod__k8s_nodes.proxmox_vm_qemu.worker["1"] is tainted, so must be replaced
-/+ resource "proxmox_vm_qemu" "worker" {
      ~ boot                   = "order=virtio0;ide0;net0" -> (known after apply)
      + bootdisk               = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      ~ id                     = "pve-01/qemu/821" -> (known after apply)
      ~ linked_vmid            = 0 -> (known after apply)
        name                   = "prod-k8s-wk-01"
      ~ reboot_required        = false -> (known after apply)
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = "prod;terraform;k8s;worker"
      ~ unused_disk            = [] -> (known after apply)
      ~ vm_state               = "stopped" -> "running"
        # (40 unchanged attributes hidden)

      ~ disks {
          ~ virtio {
              ~ virtio0 {
                  ~ disk {
                      - discard              = false -> null
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (19 unchanged attributes hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:98:bb:5d" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "dde3801f-9a33-43bc-94e7-90a1071c4306" -> null
            # (6 unchanged attributes hidden)
        }

      - vga {
          - memory = 0 -> null
          - type   = "serial0" -> null
        }
      + vga {
          + type = "serial0"
        }

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + prod__k8s_control_plane_nodes = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-cp-01"
        },
    ]
  + prod__k8s_gateway_node        = {
      + ip0     = (known after apply)
      + vm_name = "prod-k8s-gw-01"
    }
  + prod__k8s_worker_nodes        = [
      + {
          + ip0     = (known after apply)
          + vm_name = "prod-k8s-wk-01"
        },
    ]
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":78,"Program":"tfcmt","SHA1":"38ad160b60db370399007f71e4bcda327af50f6d","Vars":{},"WorkflowName":"Terraform CI"} -->